Config/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОКП</Name>
					<Comment>Код по общероссийскому классификатору продукции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРаспределенияСтоимостиПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыРаспределенияСтоимостиПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСпецификацияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment> Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожетСодержатьДрагМатериалы</Name>
					<Comment>Содержание драг. материалов будет определено после списания и утилизации.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляЧекаККМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПроизводственнойОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроизводственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходноеСырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМаркируемойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркируемойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаНоменклатурнойКлассификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>27</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоКТРУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектСПрослеживаемымиТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрослеживаемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесПоСертификатуТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьКлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключитьВСоставВнеоборотныхАктивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДополнительное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодGTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзготовительОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕКПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиныйКодификаторПредметовСнабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРаздел7ДекларацииНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыОперацийРаздела7ДекларацииПоНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDНоменклатурыОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияПрослеживаемости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрослеживаемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомплектСПрослеживаемымиТоварами</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/СоставНоменклатурныхГрупп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоставНоменклатурныхГрупп</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент распределения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Госуслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Блюдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>Горюче-смазочные материалы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолоднякИЖивотныеНаОткорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МягкийИнвентарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Посуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПитания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стройматериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиологическиеАктивы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ТипыПроизводственныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПроизводственныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сборка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/Номенклатура/Forms/ЗаполнениеПоСпецификации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Номенклатура  = Параметры.Номенклатура;
	ДатаДокумента = Параметры.ДатаДокумента;
	Организация   = Параметры.Организация;
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ТипНоменклатуры, ТипПроизводственнойОперации, ИсходноеСырье");
	Если РеквизитыНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.НоменклатурнаяГруппа Тогда
		Если РеквизитыНоменклатуры.ТипПроизводственнойОперации = Перечисления.ТипыПроизводственныхОпераций.Разделка Тогда
			ИсходноеСырье = РеквизитыНоменклатуры.ИсходноеСырье;
			ИспользуетсяИсходноеСырье = Истина;
		Иначе
			ЗаполнитьСоставНоменклатурнойГруппы();
		КонецЕсли;
	Иначе
		НоваяСтрока = СоставГруппы.Добавить(); 
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Спецификация = СпецификацияНоменклатуры();
	КонецЕсли;
	
	УстановитьВидимостьИсходногоСырья();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Если ПроверитьЗаполнениеФормы() Тогда
		Закрыть(?(ИспользуетсяИсходноеСырье, ВозвращаемаяНоменклатураПоИсходномуСырью(), ВозвращаемаяНоменклатураПоСпецификациям()));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СоставГруппыСпецификация");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СоставГруппы.Спецификация", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СоставГруппы.Количество", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИсходногоСырья()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсходноеСырье", "Видимость", ИспользуетсяИсходноеСырье); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Количество",    "Видимость", ИспользуетсяИсходноеСырье); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставГруппы",  "Видимость", НЕ ИспользуетсяИсходноеСырье); 
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеФормы()
	
	Отказ = Ложь;
	
	НомерСтроки = 0;
	Для Каждого СтрокаТаблицы Из СоставГруппы Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если СтрокаТаблицы.Количество <> 0 И Не ЗначениеЗаполнено(СтрокаТаблицы.Спецификация) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена спецификация'"),,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СоставГруппы", НомерСтроки, "Спецификация"),, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИспользуетсяИсходноеСырье Тогда
		Если Не ЗначениеЗаполнено(ИсходноеСырье) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено исходное сырье'"),,"ИсходноеСырье",,Отказ);
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСоставНоменклатурнойГруппы()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставНоменклатурныхГрупп.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СоставНоменклатурныхГрупп.Номенклатура.ОсновнаяСпецификацияНоменклатуры, ЗНАЧЕНИЕ(Справочник.СпецификацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СпецификацииНоменклатуры.ПустаяСсылка)
	|			ТОГДА МАКСИМУМ(СпецификацииНоменклатуры.Ссылка)
	|		ИНАЧЕ СоставНоменклатурныхГрупп.Номенклатура.ОсновнаяСпецификацияНоменклатуры
	|	КОНЕЦ КАК Спецификация
	|ИЗ
	|	РегистрСведений.СоставНоменклатурныхГрупп КАК СоставНоменклатурныхГрупп
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
	|		ПО СоставНоменклатурныхГрупп.Номенклатура = СпецификацииНоменклатуры.Владелец
	|			И (СпецификацииНоменклатуры.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	СоставНоменклатурныхГрупп.НоменклатурнаяГруппа = &НоменклатурнаяГруппа
	|
	|СГРУППИРОВАТЬ ПО
	|	СоставНоменклатурныхГрупп.Номенклатура,
	|	СоставНоменклатурныхГрупп.Номенклатура.ОсновнаяСпецификацияНоменклатуры";
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СоставГруппы.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Спецификация = Выборка.Спецификация;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ВозвращаемаяНоменклатураПоСпецификациям()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"Выбрать
	|	СоставГруппы.Номенклатура,
	|	СоставГруппы.Спецификация,
	|	СоставГруппы.Количество
	|Поместить СоставГруппы
	|Из
	|	&СоставГруппы КАК СоставГруппы
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпецификацииНоменклатурыСпецификация.Номенклатура,
	|	СУММА(ВЫБОР
	|		КОГДА СпецификацииНоменклатуры.Количество = 0
	|			ТОГДА СпецификацииНоменклатурыСпецификация.Количество * СоставГруппы.Количество
	|		ИНАЧЕ СпецификацииНоменклатурыСпецификация.Количество * СоставГруппы.Количество /
	|			СпецификацииНоменклатуры.Количество
	|	КОНЕЦ) КАК Количество
	|ИЗ
	|	СоставГруппы КАК СоставГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.Спецификация КАК СпецификацииНоменклатурыСпецификация
	|		ПО СоставГруппы.Спецификация = СпецификацииНоменклатурыСпецификация.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
	|		ПО СоставГруппы.Спецификация = СпецификацииНоменклатуры.Ссылка
	|ГДЕ
	|	СоставГруппы.Количество <> 0
	|	
	|СГРУППИРОВАТЬ ПО
	|	СпецификацииНоменклатурыСпецификация.Номенклатура";
	Запрос.УстановитьПараметр("СоставГруппы", СоставГруппы.Выгрузить());
	
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаНоменклатуры);
	
КонецФункции

&НаСервере
Функция ВозвращаемаяНоменклатураПоИсходномуСырью()
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("Количество",   Новый ОписаниеТипов("Число"));
	
	НоваяСтрока = ТаблицаНоменклатуры.Добавить();
	НоваяСтрока.Номенклатура = ИсходноеСырье;
	НоваяСтрока.Количество   = Количество;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаНоменклатуры);
	
КонецФункции

&НаСервере
Функция СпецификацияНоменклатуры()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.ОсновнаяСпецификацияНоменклатуры КАК Спецификация,
	|	1 КАК Порядок
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|	И Номенклатура.ОсновнаяСпецификацияНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СпецификацииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпецификацииНоменклатуры.Ссылка,
	|	2
	|ИЗ
	|	Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
	|ГДЕ
	|	СпецификацииНоменклатуры.Владелец = &Номенклатура
	|	И СпецификацииНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Спецификация;
	КонецЕсли;
	Возврат Справочники.СпецификацииНоменклатуры.ПустаяСсылка();
КонецФункции

#КонецОбласти
